toucan/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at", "link") VALUES (?, ?, ?, ?, ?)
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#code"], ["created_at", "2018-04-04 23:59:25.828239"], ["updated_at", "2018-04-04 23:59:25.828239"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."phrase" = ? LIMIT ?  [["phrase", "#code"], ["LIMIT", 1]]
INSERT INTO "tweet_tags" ("tweet_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 6], ["tag_id", 1], ["created_at", "2018-04-04 23:59:25.900286"], ["updated_at", "2018-04-04 23:59:25.900286"]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "i love to <a href='/tag_tweets?id=1'>#code</a>"], ["updated_at", "2018-04-04 23:59:25.921302"], ["id", 6]]
---
  def create
    @tweet = Tweet.create(tweet_params)

    message_arr = @tweet.message.split

    message_arr.each_with_index do |word, index|
      if word[0] == "#"
        tag = Tag.find_or_create_by(phrase: word)
        TweetTag.create(tweet_id: @tweet.id, tag_id: tag.id)
        message_arr[index] = "<a href='/tag_tweets?id=#{tag.id}'>#{word}</a>"
      end
    end

    @tweet.update(message: message_arr.join(" "))

UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "This is my first tweet"], ["updated_at", "2018-04-03 00:35:24.874049"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)