toucan/app/views/epicenter/feed.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = 1
---
      <h4>Your Stats</h4>
        <%= pluralize current_user.tweets.count, 'tweet' %>

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <% @trending_tags.each do |tag_id, count| %>
            <% tag = Tag.find(tag_id) %>